DivinityQQ/iaq-monitor-esp32/sdkconfig.defaults
# sdkconfig.defaults
# Default configuration for IAQ Monitor

# ESP32-S3 specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_UNICORE=n

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="iaq-monitor"
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y

# HTTP Server (for future web config)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n
CONFIG_MQTT_USE_CUSTOM_CONFIG=n
CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED=y
CONFIG_MQTT_USE_CORE_1=y

# TLS certificate bundle (for mqtts public CAs)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Use the smaller "common" selection instead of full bundle
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# MQTT QoS Levels
CONFIG_IAQ_MQTT_CRITICAL_QOS=1
CONFIG_IAQ_MQTT_TELEMETRY_QOS=0

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Compile out DEBUG/VERBOSE to reduce size and overhead
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable filesystem support (for future web server)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# NVS
CONFIG_NVS_ENCRYPTION=n  # Enable later for production

# Console (for runtime commands)
# Set the primary console to the on‑chip USB‑Serial/JTAG (CDC ACM on /dev/ttyACM*)
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# Do not mirror logs to a secondary console
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Power Management (disabled for now)
CONFIG_PM_ENABLE=n

# Watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Core dump
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y

# Optimization
# Prefer -O2 (performance) instead of debug
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Keep assertions enabled (maps to -DNDEBUG off)
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
